# Домашнее задание 2 (5 баллов).

Все задания ниже имеют равный вес (5/16).

In [3]:
import pandas as pd
import time

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [4]:
!wget https://raw.githubusercontent.com/hse-ds/iad-intro-ds/master/2022/homeworks/Data.zip # скачивание файла из гит
    
import zipfile
archive = zipfile.ZipFile('Data.zip', 'r')
archive.extractall('.')  # Извлечение всех файлов в ту же директорию

--2022-02-10 17:37:39--  https://raw.githubusercontent.com/hse-ds/iad-intro-ds/master/2022/homeworks/Data.zip
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.108.133, 185.199.109.133, 185.199.110.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.108.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 16727 (16K) [application/zip]
Saving to: ‘Data.zip.1’

Data.zip.1          100%[===================>]  16.33K  --.-KB/s    in 0.03s

2022-02-10 17:37:39 (480 KB/s) - ‘Data.zip.1’ saved [16727/16727]

In [87]:
student_info = []
student_marks = []
for i in range(10):
    student_info.append(pd.read_csv(f'Data/Students_info_{i}.csv'))
for i in range(10):
    student_marks.append(pd.read_csv(f'Data/Students_marks_{i}.csv'))
    
df_info = pd.concat(student_info, ignore_index=True)
df_marks = pd.concat(student_marks, ignore_index=True)
df = pd.merge(df_info, df_marks, on='index', how='left')
df.head()

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,1,female,group C,some college,standard,completed,group1,69,90,88
2,2,female,group B,master's degree,standard,none,group1,90,95,93
3,3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,4,male,group C,some college,standard,none,group1,76,78,75

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [88]:
df.drop("index", axis=1, inplace=True)
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Задание 3. Выведите на экран размеры полученной таблицы

In [7]:
print(df.shape, df.size, sep="\n")

(1000, 9)
9000

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [8]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [9]:
df.isnull().sum() # показывает количество прпущенных значений для каждого столбца

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
group                          0
math score                     0
reading score                  0
writing score                  0
dtype: int64

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [10]:
df.select_dtypes(include='number').mean() #выбираем столбцы с числами (иначе mean выдаст ошибку)

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [92]:
df.groupby("test preparation course").mean()

                         math score  reading score  writing score
test preparation course
completed                 69.695531      73.893855      74.418994
none                      64.077882      66.534268      64.504673

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [79]:
set(df["lunch"])

{'free/reduced', 'standard'}

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [95]:
df.rename(columns={"parental level of education": "education", "test preparation course": "test preparation"}, inplace=True)
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75

**Зафиксируем минимальный балл для сдачи экзамена**

In [81]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark >= 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [82]:
print(df[df['math score'] >= passmark].shape[0] / df.shape[0], 
      df[(df['test preparation'] == 'completed') & (df['math score'] >= passmark)].shape[0] / df[df['test preparation'] == 'completed'].shape[0], 
      df[(df.gender == 'female') & (df['test preparation'] == 'none') & (df['math score'] < passmark)].shape[0] / df[(df.gender == 'female') & (df['test preparation'] == 'none')].shape[0], 
      sep='\n')

0.865
0.9217877094972067
0.20958083832335328

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [93]:
start = time.time()
print(df.groupby('race/ethnicity')['reading score'].mean(), sep='\n\n')
end = time.time()
end - start

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64

0.049356698989868164

In [96]:
start = time.time()
print(df.groupby('education')['writing score'].min(), sep='\n\n')
end = time.time()
end - start

education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64

0.007008552551269531

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [98]:
start = time.time()
dic = {}
for i in range(len(df["race/ethnicity"])):
    try:
        dic[df["race/ethnicity"][i]][0] += df["reading score"][i]
        dic[df["race/ethnicity"][i]][1] += 1
    except KeyError:
        dic[df["race/ethnicity"][i]] = [df["reading score"][i], 1]
for key in sorted(dic.keys()):
    print(f"{key}\t\t{dic[key][0]/dic[key][1]}")
end = time.time()
print()
end - start

group A		64.67415730337079
group B		67.35263157894737
group C		69.10344827586206
group D		70.03053435114504
group E		73.02857142857142

0.02006673812866211

In [99]:
start = time.time()
eddic = {}
for i in range(len(df["education"])):
    try:
        if df["writing score"][i] < eddic[df["education"][i]]:
            eddic[df["education"][i]] = df["writing score"][i]
    except KeyError:
        eddic[df["education"][i]] = df["writing score"][i]
for key in sorted(eddic.keys()):
    print(f"{key} = {eddic[key]}")
end = time.time()
print()
end - start

associate's degree = 35
bachelor's degree = 38
high school = 15
master's degree = 46
some college = 19
some high school = 10

0.017296552658081055

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [36]:
df.pivot_table(index=['gender', 'education'], aggfunc='mean')

                           math score  reading score  writing score
gender education
female associate's degree   65.250000      74.120690      74.000000
       bachelor's degree    68.349206      77.285714      78.380952
       high school          59.351064      68.202128      66.691489
       master's degree      66.500000      76.805556      77.638889
       some college         65.406780      73.550847      74.050847
       some high school     59.296703      69.109890      68.285714
male   associate's degree   70.764151      67.433962      65.405660
       bachelor's degree    70.581818      68.090909      67.654545
       high school          64.705882      61.480392      58.539216
       master's degree      74.826087      73.130435      72.608696
       some college         69.009259      64.990741      63.148148
       some high school     67.840909      64.693182      61.375000

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [37]:
df["Math_PassStatus"] = df["math score"].apply(lambda x: 'P' if x >= passmark else "F")
df.groupby("Math_PassStatus")['math score'].count()

Math_PassStatus
F    135
P    865
Name: math score, dtype: int64

In [38]:
df["Reading_PassStatus"] = df["reading score"].apply(lambda x: 'P' if x >= passmark else "F")
df.groupby("Reading_PassStatus")['reading score'].count()

Reading_PassStatus
F     90
P    910
Name: reading score, dtype: int64

In [64]:
df["Writing_PassStatus"] = df["writing score"].apply(lambda x: 'P' if x >= passmark else "F")
df.groupby("Writing_PassStatus")['writing score'].count()

Writing_PassStatus
F    114
P    886
Name: writing score, dtype: int64

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [73]:
df["OverAll_PassStatus"] = df.loc[::, "Math_PassStatus":"Writing_PassStatus"].apply(lambda x: 
                                                                                    'P' if 
                                                                                    (x[0] =='P') & (x[1] == 'P') & (x[2] == 'P')
                                                                                    else "F", axis=1)
df[df["OverAll_PassStatus"] == "P"].shape[0]

812

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####    больше 90 = A
####      80-90 = B
####      70-80 = C
####      60-70 = D
####      50-60 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

**В случае, если средний балл попадает на границу между оценками (т.е. равен ровно 60, 70 или 80 баллов), вы можете интерпретировать условие на своё усмотрение (т.е. можете поставить за 60 баллов оценку D, а можете - E).**

In [67]:
def GetGrade(average_mark):
    if average_mark >= 90:
        return "A"
    elif average_mark >= 80:
        return "B"
    elif average_mark >= 70:
        return "C"
    elif average_mark >= 60:
        return "D"
    elif average_mark >= 50:
        return "E"
    else:
        return "F"

df["Grade"] = df.loc[::, "math score":"writing score"].apply(lambda x: GetGrade(sum(x) / 3), axis=1)
df.groupby("Grade")["group"].count()

Grade
A     52
B    146
C    261
D    256
E    182
F    103
Name: group, dtype: int64